<script setup lang="ts">
import { ref } from 'vue';
import { useSelectStore } from '@/stores/SelectStore.ts';

const selectStore  = useSelectStore();
const { getTypeAPIData } = selectStore;

const activeItemSecond = ref('home');

const changeType = (newType: string) : void => {
  selectStore.type = newType;
  getTypeAPIData(newType);
};

const isActive = (tabType: string) => {
  return selectStore.type === tabType;
};

const selectItemSecond = (itemId: string) => {
  activeItemSecond.value = itemId;
};

//切換採種
interface LotteryOption {
  id: string;
  type: string;
  activeImg: string;
  inactiveImg: string;
  text: string;
};

const typeOptions: LotteryOption[] = [
  {
    id: 'Aomen',
    type: '1',
    activeImg: './src/assets/amwhite.png',
    inactiveImg: './src/assets/am.png',
    text: '六合彩'
  },
  {
    id: 'SixtyAomen',
    type: '3',
    activeImg: './src/assets/amwhite.png',
    inactiveImg: './src/assets/am.png',
    text: '六十彩'
  },
  {
    id: 'HongKong',
    type: '2',
    activeImg: './src/assets/hkwhite.png',
    inactiveImg: './src/assets/hk.png',
    text: '六合彩'
  },
  {
    id: 'SixtyHongKong',
    type: '4',
    activeImg: './src/assets/hkwhite.png',
    inactiveImg: './src/assets/hk.png',
    text: '六十彩'
  }
];

//最下方
interface RegularNavItem {
  id: string;
  icon: string;
  text: string;
  special?: undefined;
};

interface SpecialNavItem {
  id: string;
  special: boolean;
  icon: string;
  text: string;
};

type NavItem = RegularNavItem | SpecialNavItem;

const navItems: NavItem[] = [
  {
    id: 'home',
    icon: `<svg viewBox="0 0 20 19" xmlns="http://www.w3.org/2000/svg" style="fill: #4b5cc4;"><path d="M8 17.5v-6h4v6h5v-8h3l-10-9-10 9h3v8h5Z" fill-rule="evenodd"></path></svg>`,
    text: '首页'
  },
  {
    id: 'agent',
    icon: `<svg viewBox="0 0 80 80" xmlns="http://www.w3.org/2000/svg" style="fill: #4b5cc4;">
            <path d="M59.1084 47.1288C56.2009 47.1288 53.5279 46.5166 51.0894 45.2922C48.6508 44.0208 46.6812 42.2078 45.1806 39.8532C43.7269 37.4515 43 34.5554 43 31.1648C43 27.8213 43.7503 24.8546 45.251 22.2645C46.7985 19.6745 48.9322 17.6496 51.6521 16.1898C54.372 14.7299 57.5139 14 61.078 14C65.0171 14 68.3935 14.9654 71.2072 16.8961C74.0209 18.7798 76.1781 21.5111 77.6787 25.09C79.2262 28.6219 80 32.813 80 37.6634C80 42.8906 79.1559 47.5762 77.4677 51.7202C75.8264 55.8172 73.4582 59.0665 70.3631 61.4681C67.315 63.8227 63.6806 65 59.4601 65C56.7871 65 54.4658 64.5762 52.4962 63.7285C50.5735 62.8338 48.9791 61.7036 47.7129 60.338C46.4468 58.9723 45.4854 57.536 44.8289 56.0291C44.1724 54.4751 43.7972 53.0152 43.7034 51.6496H52.7072C52.9886 53.4861 53.7624 54.946 55.0285 56.0291C56.2947 57.0651 57.8657 57.5831 59.7414 57.5831C61.8517 57.5831 63.6572 56.9238 65.1578 55.6053C66.7053 54.2867 67.9246 52.4501 68.8156 50.0956C69.7535 47.741 70.3397 44.9862 70.5741 41.831C69.1673 43.5734 67.526 44.892 65.6502 45.7867C63.7744 46.6814 61.5938 47.1288 59.1084 47.1288ZM61.0076 21.4169C59.2725 21.4169 57.725 21.8172 56.365 22.6177C55.052 23.4183 54.0203 24.5485 53.27 26.0083C52.5665 27.4211 52.2148 29.0457 52.2148 30.8823C52.2148 32.7188 52.5665 34.3199 53.27 35.6856C54.0203 37.0042 55.052 38.0402 56.365 38.7936C57.6781 39.5 59.2022 39.8532 60.9373 39.8532C63.0944 39.8532 64.9702 39.3352 66.5646 38.2992C68.206 37.2632 69.5659 35.8269 70.6445 33.9903C70.2693 30.1288 69.2376 27.0679 67.5494 24.8075C65.9081 22.5471 63.7275 21.4169 61.0076 21.4169Z"></path>
            <path d="M23.811 64V52.3954H0V46.0917L20.6409 14H32.8986V44.8739H41V52.3954H32.8986V64H23.811ZM9.15808 44.8739H23.811V31.6218L23.9519 21.1633L18.5979 30.1891L9.15808 44.8739Z"></path>
          </svg>`,
    text: '代理'
  },
  {
    id: 'exclusive',
    special: true,
    icon: `<svg version="1.1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 51.024 51.023" style="fill: #4b5cc4;">
            <g>
              <circle fill-rule="evenodd" clip-rule="evenodd" cx="25.512" cy="25.511" r="25.512"></circle>
              <path fill-rule="evenodd" clip-rule="evenodd" fill="#FFFFFF" d="M17.646,18.52c-0.93-2.169-2.892-5.611-4.476-8.159
                l-3.684,1.652c1.516,2.651,3.374,6.231,4.131,8.434L17.646,18.52L17.646,18.52z M13.825,39.589
                c1.48-3.443,3.132-7.643,4.544-11.705l-3.821-1.859c-1.549,4.338-3.545,8.916-5.026,11.774L13.825,39.589L13.825,39.589z
                M24.015,31.946h6.196v3.339h-6.196V31.946L24.015,31.946z M30.211,21.722h-6.196v-3.27h6.196V21.722L30.211,21.722z
                M30.211,28.435h-6.196v-3.202h6.196V28.435L30.211,28.435z M41.538,35.285v3.649H24.015v2.237h-3.752V23.271
                c-0.792,1.032-1.619,2.031-2.444,2.892c-0.62-0.792-2.066-2.307-2.858-2.995c3.546-3.236,6.507-8.503,8.16-13.943l3.787,0.93
                c-0.551,1.617-1.17,3.201-1.859,4.75h6.162c-0.619-1.342-1.549-2.961-2.341-4.234l3.511-1.584
                c1.103,1.515,2.307,3.546,2.928,4.889l-1.791,0.929h7.47v3.546h-6.781v3.27h6.128v3.511h-6.128v3.202h6.059v3.512h-6.059v3.339
                H41.538z"></path>
            </g>
          </svg>`,
    text: '独家内幕'
  },
  {
    id: 'treasure',
    icon: `<svg viewBox="0 0 80 80" xmlns="http://www.w3.org/2000/svg" style="fill: #4b5cc4;">
            <path d="M59.1084 47.1288C56.2009 47.1288 53.5279 46.5166 51.0894 45.2922C48.6508 44.0208 46.6812 42.2078 45.1806 39.8532C43.7269 37.4515 43 34.5554 43 31.1648C43 27.8213 43.7503 24.8546 45.251 22.2645C46.7985 19.6745 48.9322 17.6496 51.6521 16.1898C54.372 14.7299 57.5139 14 61.078 14C65.0171 14 68.3935 14.9654 71.2072 16.8961C74.0209 18.7798 76.1781 21.5111 77.6787 25.09C79.2262 28.6219 80 32.813 80 37.6634C80 42.8906 79.1559 47.5762 77.4677 51.7202C75.8264 55.8172 73.4582 59.0665 70.3631 61.4681C67.315 63.8227 63.6806 65 59.4601 65C56.7871 65 54.4658 64.5762 52.4962 63.7285C50.5735 62.8338 48.9791 61.7036 47.7129 60.338C46.4468 58.9723 45.4854 57.536 44.8289 56.0291C44.1724 54.4751 43.7972 53.0152 43.7034 51.6496H52.7072C52.9886 53.4861 53.7624 54.946 55.0285 56.0291C56.2947 57.0651 57.8657 57.5831 59.7414 57.5831C61.8517 57.5831 63.6572 56.9238 65.1578 55.6053C66.7053 54.2867 67.9246 52.4501 68.8156 50.0956C69.7535 47.741 70.3397 44.9862 70.5741 41.831C69.1673 43.5734 67.526 44.892 65.6502 45.7867C63.7744 46.6814 61.5938 47.1288 59.1084 47.1288ZM61.0076 21.4169C59.2725 21.4169 57.725 21.8172 56.365 22.6177C55.052 23.4183 54.0203 24.5485 53.27 26.0083C52.5665 27.4211 52.2148 29.0457 52.2148 30.8823C52.2148 32.7188 52.5665 34.3199 53.27 35.6856C54.0203 37.0042 55.052 38.0402 56.365 38.7936C57.6781 39.5 59.2022 39.8532 60.9373 39.8532C63.0944 39.8532 64.9702 39.3352 66.5646 38.2992C68.206 37.2632 69.5659 35.8269 70.6445 33.9903C70.2693 30.1288 69.2376 27.0679 67.5494 24.8075C65.9081 22.5471 63.7275 21.4169 61.0076 21.4169Z"></path>
            <path d="M23.811 64V52.3954H0V46.0917L20.6409 14H32.8986V44.8739H41V52.3954H32.8986V64H23.811ZM9.15808 44.8739H23.811V31.6218L23.9519 21.1633L18.5979 30.1891L9.15808 44.8739Z"></path>
          </svg>`,
    text: '寻宝'
  },
  {
    id: 'gallery',
    icon: `<svg viewBox="0 0 80 80" xmlns="http://www.w3.org/2000/svg" style="fill: #4b5cc4;">
            <path d="M59.1084 47.1288C56.2009 47.1288 53.5279 46.5166 51.0894 45.2922C48.6508 44.0208 46.6812 42.2078 45.1806 39.8532C43.7269 37.4515 43 34.5554 43 31.1648C43 27.8213 43.7503 24.8546 45.251 22.2645C46.7985 19.6745 48.9322 17.6496 51.6521 16.1898C54.372 14.7299 57.5139 14 61.078 14C65.0171 14 68.3935 14.9654 71.2072 16.8961C74.0209 18.7798 76.1781 21.5111 77.6787 25.09C79.2262 28.6219 80 32.813 80 37.6634C80 42.8906 79.1559 47.5762 77.4677 51.7202C75.8264 55.8172 73.4582 59.0665 70.3631 61.4681C67.315 63.8227 63.6806 65 59.4601 65C56.7871 65 54.4658 64.5762 52.4962 63.7285C50.5735 62.8338 48.9791 61.7036 47.7129 60.338C46.4468 58.9723 45.4854 57.536 44.8289 56.0291C44.1724 54.4751 43.7972 53.0152 43.7034 51.6496H52.7072C52.9886 53.4861 53.7624 54.946 55.0285 56.0291C56.2947 57.0651 57.8657 57.5831 59.7414 57.5831C61.8517 57.5831 63.6572 56.9238 65.1578 55.6053C66.7053 54.2867 67.9246 52.4501 68.8156 50.0956C69.7535 47.741 70.3397 44.9862 70.5741 41.831C69.1673 43.5734 67.526 44.892 65.6502 45.7867C63.7744 46.6814 61.5938 47.1288 59.1084 47.1288ZM61.0076 21.4169C59.2725 21.4169 57.725 21.8172 56.365 22.6177C55.052 23.4183 54.0203 24.5485 53.27 26.0083C52.5665 27.4211 52.2148 29.0457 52.2148 30.8823C52.2148 32.7188 52.5665 34.3199 53.27 35.6856C54.0203 37.0042 55.052 38.0402 56.365 38.7936C57.6781 39.5 59.2022 39.8532 60.9373 39.8532C63.0944 39.8532 64.9702 39.3352 66.5646 38.2992C68.206 37.2632 69.5659 35.8269 70.6445 33.9903C70.2693 30.1288 69.2376 27.0679 67.5494 24.8075C65.9081 22.5471 63.7275 21.4169 61.0076 21.4169Z"></path>
            <path d="M23.811 64V52.3954H0V46.0917L20.6409 14H32.8986V44.8739H41V52.3954H32.8986V64H23.811ZM9.15808 44.8739H23.811V31.6218L23.9519 21.1633L18.5979 30.1891L9.15808 44.8739Z"></path>
          </svg>`,
    text: '图库'
  }
];
</script>

<template>
  <div class="bottom-nav">
    <div class="bottom-change-page bg-white">
      <ul>
        <li
          v-for="item in typeOptions"
          :key="item.id"
          class="flex items-center justify-center gap-1 py-1 m-0.5 cursor-pointer border-2 border-[#4b5cc4]"
          :class="{
            'bg-[#4b5cc4] text-white': isActive(item.type)
          }"
          @click="changeType(item.type)"
        >
          <img :src="isActive(item.type) ? item.activeImg : item.inactiveImg" alt="icon" class="w-5 h-5" />
          <span class="font-medium">{{ item.text }}</span>
        </li>
      </ul>
    </div>
    <div class="p-1"></div>
    <div class="baomaqg-btn4-box-father-five-bottom p-1 flex justify-around items-center bg-white">
      <div
        v-for="item in navItems"
        :key="item.id"
        class="nav-item flex flex-col items-center gap-1 cursor-pointer p-1 rounded-full"
        :class="{
          '': activeItemSecond === item.id,
          '': activeItemSecond !== item.id
        }"
        @click="selectItemSecond(item.id)"
      >
        <div class="w-7 h-5 flex items-center justify-center" :class="{ 'w-11 h-9 absolute top-10': item.special }" v-html="item.icon"></div>
        <span class="text-xs mt-1 special-item" :class="{ 'font-medium': item.special }" :style="{ 'margin-top': item.special ? '25px' : '0' }">{{ item.text }}</span>
      </div>
    </div>
  </div>
</template>

<style scoped>
.bottom-change-page ul {
  display: flex;
  justify-content: space-between;
  align-items: center;
  padding: 0;
  margin: 0;
}

.bottom-change-page li {
  flex: 1;
  border-radius: 0.2rem;
}
.bottom-nav {
  position: fixed;
  bottom: 0;
  left: 0;
  right: 0;
}
</style>
